; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p6---int100n150-m25---int100c110---s50---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level21 level24)
(sum level4 level2 level6)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level21 level25)
(sum level5 level2 level7)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level21 level26)
(sum level6 level2 level8)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level21 level27)
(sum level7 level2 level9)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level8 level2 level10)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level9 level2 level11)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level10 level2 level12)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level11 level2 level13)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level12 level2 level14)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level13 level2 level15)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level14 level2 level16)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level15 level2 level17)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level16 level2 level18)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level17 level2 level19)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level18 level2 level20)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level19 level2 level21)
(sum level19 level7 level26)
(sum level20 level2 level22)
(sum level20 level7 level27)
(sum level21 level2 level23)
(sum level22 level2 level24)
(sum level23 level2 level25)
(sum level24 level2 level26)
(sum level25 level2 level27)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)
(connected l2 l3)
(fuelcost level7 l2 l3)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level7 l3 l2)

(at t0 l3)
(fuel t0 level27)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l3)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 6
2. (drive t0 l3 l2 level20 level7 level27)
   deleted: (at t0 l3) (fuel t0 level27)
   added: (at t0 l2) (fuel t0 level20)
   goals met: 0 of 6
3. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 1 of 6
4. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 1 of 6
5. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 6
6. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 6
7. (drive t0 l2 l1 level11 level9 level20)
   deleted: (at t0 l2) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 1 of 6
8. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 6
9. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 1 of 6
10. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 6
11. (drive t0 l1 l0 level4 level7 level11)
   deleted: (at t0 l1) (fuel t0 level11)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 2 of 6
12. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 6
13. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 4 of 6
14. (drive t0 l0 l3 level2 level2 level4)
   deleted: (at t0 l0) (fuel t0 level4)
   added: (at t0 l3) (fuel t0 level2)
   goals met: 4 of 6
15. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 5 of 6
16. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 6 of 6
